{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report describing two audio-related features referencing GlobalAudioProvider.tsx.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend source files.",
  "frontend/index.css": "Tailwind base setup defining OKLCH theme tokens for light and dark modes and applying global styles.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app that wraps all pages in GlobalAudioProvider and switches pages using Zustand state.",
  "frontend/src/audio/GlobalAudioProvider.tsx": "Context provider managing a persistent looping HTMLAudioElement for cani.mp4 with play/pause/toggle.",
  "frontend/src/components/FloatingHeartsBackground.tsx": "SVG-based animated floating hearts and sparkles rendered as a fixed non-interactive background.",
  "frontend/src/components/GlassPanel.tsx": "Glass-style div wrapper component merging provided className and HTML div attributes.",
  "frontend/src/components/GlobalAudioToggle.tsx": "Fixed music toggle button using GlobalAudioProvider to start or stop global audio.",
  "frontend/src/components/HeartConfetti.tsx": "Generates and animates 30 falling SVG heart confetti elements.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor based on Internet Identity and invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hooks for managing Internet Identity login, logout, and stored identities.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode styles, component classes, and custom animations.",
  "frontend/src/lib/utils.ts": "Provides a utility function combining clsx and tailwind-merge for className merging.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/Page1Welcome.tsx": "Displays a welcome screen with an initial overlay, animations, and buttons to start music or proceed.",
  "frontend/src/pages/Page2MeaningOfRoses.tsx": "Shows a grid of rose cards that reveal messages when selected and includes a button to continue.",
  "frontend/src/pages/Page3BouquetBuilder.tsx": "Lets users add animated roses to build a bouquet, wrap it, and proceed to the next page.",
  "frontend/src/pages/Page4AcceptMyFlower.tsx": "Prompts the user to accept a flower, with a playful moving 'No' button and confetti on acceptance.",
  "frontend/src/pages/Page5Music.tsx": "Shows a music-themed message with an animated icon and a button to continue.",
  "frontend/src/pages/Page6FinalMessage.tsx": "Displays the final heartfelt message before the replay page with a button to proceed.",
  "frontend/src/pages/Page7Replay.tsx": "Shows a closing screen with a bouquet and a button to replay the experience.",
  "frontend/src/state/micrositeFlowStore.ts": "Manages microsite navigation and state (page, bouquet, acceptance) using Zustand.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, specifying content paths, extending theme with OKLCH-based color system, custom containers, and adding plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing a 7‑page romantic microsite, its visual/audio requirements, architectural notes, known issues, and existing implemented features with versioning."
}