{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature-evidence manifest mapping features to related source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base and theme variable setup defining light and dark color tokens and applying global styles.",
  "frontend/index.html": "Base HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component wiring global audio, mood toggle, animated background, and routing across seven pages.",
  "frontend/src/audio/GlobalAudioProvider.tsx": "Context provider managing a persistent looping audio element with play/pause/toggle controls.",
  "frontend/src/components/FloatingHeartsBackground.tsx": "Animated SVG background rendering hearts and sparkles that adapt to day/night mode.",
  "frontend/src/components/GlassPanel.tsx": "Simple wrapper applying the global glass-panel styling to content.",
  "frontend/src/components/GlobalAudioToggle.tsx": "Fixed-position button that toggles global background music.",
  "frontend/src/components/GlobalMoodToggle.tsx": "Fixed-position button switching between day and night mode with icon changes.",
  "frontend/src/components/HeartConfetti.tsx": "Generates 30 falling heart SVGs for celebratory confetti animation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, stored identity restoration, and login status.",
  "frontend/src/index.css": "Defines Tailwind base styles plus a romantic color theme, night‑mode variants, and reusable UI utility classes.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Page1Welcome.tsx": "Displays a timed welcome overlay followed by a themed introduction page with navigation and audio controls.",
  "frontend/src/pages/Page2MeaningOfRoses.tsx": "Shows a grid of rose types with expandable meanings and a button to continue the flow.",
  "frontend/src/pages/Page3BouquetBuilder.tsx": "Lets users add up to 12 roses to a virtual bouquet and wrap it before proceeding.",
  "frontend/src/pages/Page4AcceptMyFlower.tsx": "Asks the user to accept a flower with playful UI behavior and shows confetti and a thank‑you screen upon acceptance.",
  "frontend/src/pages/Page5Music.tsx": "Renders a music-themed page with an icon, instructions for using the music toggle, and a Next button triggering the flow store’s next action.",
  "frontend/src/pages/Page6FinalMessage.tsx": "Displays a final heartfelt message with styled text and a Next button that advances the microsite flow.",
  "frontend/src/pages/Page7Replay.tsx": "Shows a closing farewell screen with an image, sentimental text, and a replay button that restarts the flow.",
  "frontend/src/state/micrositeFlowStore.ts": "Defines a Zustand store managing page flow state, including advancing pages, replaying, and flags for bouquet and flower acceptance.",
  "frontend/src/state/moodStore.ts": "Creates a Zustand store for day/night mode with sessionStorage persistence and a toggle function.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended color palettes, plugins, and custom theme settings including rose and pink color scales.",
  "project_state.json": "Describes the project’s state, goals, known issues, and thematic/technical requirements for the romantic microsite."
}